[
  {
  "title": "Control of Multivariable Process",
  "subtitle": "Designinh the PID COntroller for a Newell and Lee Evaporator",
  "description": "This project focuses on modeling and controlling the Newell and Lee forced circulation evaporator using MATLAB and Simulink. The system was analyzed for its steady-state and dynamic responses, revealing instability under open-loop conditions. A 2x2 MIMO control strategy was developed from the original 3x3 system using Relative Gain Array (RGA) analysis, and SISO PID controllers were designed and tuned using both Ziegler–Nichols and relay feedback methods to optimize rise time, settling time, and overshoot.",
  "technologies": ["MATLAB", "Simulink", "PID -Tuning"],
  "image": "assets/img/portfolio/doctorphi.jpg",
  "githubLink": "https://github.com/Sasi-vadde/Projects"
},
  {
    "title": "CFD Simulation of Airflow around the Arc de Triomphe",
    "subtitle": "A Computational Fluid Dynamics Analysis",
    "image": "assets/img/portfolio/portfolio-1.jpg",
    "description": "This project involved performing a CFD simulation to analyze the airflow around the Arc de Triomphe. The simulation explored the flow characteristics, including velocity, pressure, drag, and lift forces, for inflow velocities of 9 m/s and 18 m/s. The analysis revealed that while the drag coefficient remains nearly constant for a given flow direction, the drag force itself increases as the velocity increases.",
    "technologies": ["StarCCM+", "Mesh Generation", "Turbulence Modeling", "Flow Characterstics"],
    "githubLink": "https://github.com/Sasi-vadde/Projects"
  },
  {
    "title": "Single Particle Trajectory Simulation for Explosion Prevention",
    "subtitle": "Single Particle Simulation",
    "image": "assets/img/portfolio/portfolio-2.jpg",
    "description": "This presentation demonstrates how numerical simulations using OpenFOAM can be applied to explosion prevention by tracking a single particle's motion within a defined box. Using a Lagrangian approach with the Discrete Particle Modelling (DPM) solver, boundary conditions such as inlet/outlet pressures, particle position, and velocity are specified. The simulation results are visualized in ParaView, providing insights into particle trajectories between parallel plates under specified flow and pressure conditions.",
    "technologies": ["OpenFOAM", "C++", "Fusion 360"],
    "githubLink": "https://github.com/Sasi-vadde/Projects"
  },
  {
  "title": "Numerical Simulation of Convection Airflow Around Heating Elements",
  "subtitle": "MA Study on Mesh Resolution and Plate Distance Using OpenFOAM",
  "description": "Convection airflow around two rectangular heating elements. Using OpenFOAM, the simulation varied the mesh resolution and the distance between the plates. The report notes that heat loss due to radiation was considered low and was therefore neglected.",
  "technologies": ["OpenFOAM", "ANSYS"],
  "image": "assets/img/portfolio/promptshell.jpg",
  "githubLink": "https://github.com/Sasi-vadde/Projects"
},
  {
    "title": "MLCE 2023 Project: Vapor Pressure Prediction",
    "subtitle": "Predicting Vapor Pressures Using Machine Learning",
    "image": "assets/img/portfolio/portfolio-3.jpg",
    "description": "The aim of this project is to predict the vapor pressure of various chemical species as a function of temperature and molecular descriptors. The data set used for this task is derived from the MLCE book and the RDKit toolkit. The data includes temperatures in Kelvin (K) and pressures in kilopascals (kPa).",
    "technologies": ["Python"],
    "githubLink": "https://github.com/Sasi-vadde/Projects"
  }
  
]
